
#Область ПрограммныйИнтерфейс

Процедура ДополнитьФорму(Форма) Экспорт  
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередОснование(Форма);
		ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
		
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		
	КонецЕсли;
	
КонецПроцедуры    

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс  

Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)
	//++Процедура добавляет реквизит Контактное лицо на форму документа
	НовыйЭлемент = Форма.Элементы.Добавить("КонтактноеЛицо",Тип("ПолеФормы"),Форма.Элементы.ГруппаШапкаПраво);
	НовыйЭлемент.ПутьКДанным = "Объект.КонтактноеЛицо";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;   
	//--
КонецПроцедуры 


Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)
	//++Процедура вставляет реквизит Контактное лицо на форму документа	перед реквизитом сумма
	НовыйЭлемент = Форма.Элементы.Вставить("КонтактноеЛицо",Тип("ПолеФормы"), ,Форма.Элементы.СуммаДокумента);
	НовыйЭлемент.ПутьКДанным = "Объект.КонтактноеЛицо";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//--	
	
КонецПроцедуры    

 Процедура ВставитьПолеКонтактноеЛицоНаФормуПередОснование(Форма)
	//++Процедура вставляет реквизит Контактное лицо на форму документа	перед реквизитом основание
	НовыйЭлемент = Форма.Элементы.Вставить("КонтактноеЛицо",Тип("ПолеФормы"), ,Форма.Элементы.Основание);
	НовыйЭлемент.ПутьКДанным = "Объект.КонтактноеЛицо";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//--	
	
КонецПроцедуры    




#КонецОбласти

